benchmark/report/rps/full/20260804_153200/raw/019_music_list_c1_r1.txt
Running 20s test @ http://127.0.0.1:32777/api/music/library?offset=0&limit=20
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.10ms    1.75ms  50.62ms   90.22%
    Req/Sec   244.74     38.60   373.00     82.50%
  Latency Distribution
     50%    4.00ms
     75%    4.64ms
     90%    5.37ms
     99%    7.27ms
  4891 requests in 20.07s, 3.38MB read
Requests/sec:    243.70
Transfer/sec:    172.30KB
HPS_WRK_REQUESTS 4891
HPS_WRK_STATUS_ERRORS 0
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 0
HPS_STATUS_TOTAL 4891
HPS_STATUS_2XX 4891
HPS_STATUS_NON_2XX 0
HPS_STATUS_UNEXPECTED 0
HPS_STATUS_CODES 200=4891